Noosak/Infrared_Control_Desktop_STM32G030_with25Qflash/Infrared_Control/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/

#include "stm32g0xx_ll_dma.h"
#include "stm32g0xx_ll_rcc.h"
#include "stm32g0xx_ll_bus.h"
#include "stm32g0xx_ll_system.h"
#include "stm32g0xx_ll_exti.h"
#include "stm32g0xx_ll_cortex.h"
#include "stm32g0xx_ll_utils.h"
#include "stm32g0xx_ll_pwr.h"
#include "stm32g0xx_ll_spi.h"
#include "stm32g0xx_ll_tim.h"
#include "stm32g0xx_ll_usart.h"
#include "stm32g0xx_ll_gpio.h"

#if defined(USE_FULL_ASSERT)
#include "stm32_assert.h"
#endif /* USE_FULL_ASSERT */

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define LED_Pin LL_GPIO_PIN_7
#define LED_GPIO_Port GPIOB
#define GPIO1_Pin LL_GPIO_PIN_14
#define GPIO1_GPIO_Port GPIOC
#define CSB_Pin LL_GPIO_PIN_15
#define CSB_GPIO_Port GPIOC
#define SCK_Pin LL_GPIO_PIN_0
#define SCK_GPIO_Port GPIOA
#define SDIO_Pin LL_GPIO_PIN_1
#define SDIO_GPIO_Port GPIOA
#define Flash_CS_Pin LL_GPIO_PIN_4
#define Flash_CS_GPIO_Port GPIOA
#define Flash_SCK_Pin LL_GPIO_PIN_5
#define Flash_SCK_GPIO_Port GPIOA
#define Flash_MISO_Pin LL_GPIO_PIN_6
#define Flash_MISO_GPIO_Port GPIOA
#define Flash_MOSI_Pin LL_GPIO_PIN_7
#define Flash_MOSI_GPIO_Port GPIOA
#define IR_EmitT3C3_Pin LL_GPIO_PIN_0
#define IR_EmitT3C3_GPIO_Port GPIOB
#define GPIO2_Pin LL_GPIO_PIN_11
#define GPIO2_GPIO_Port GPIOA
#define GPIO2_EXTI_IRQn EXTI4_15_IRQn
#define FCSB_Pin LL_GPIO_PIN_12
#define FCSB_GPIO_Port GPIOA
#define IR_CaptureT1C3_Pin LL_GPIO_PIN_6
#define IR_CaptureT1C3_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
